Repository: BuggleInc/webPLM
Catalog: po/*.po
Languages: fr

source: Return true if the first input is greater than or equal to the second input.
fr: Renvoyer vrai si la première entrée est plus grande ou égale à la seconde.

source: Return true if the first input is greater than the second input.
fr: Renvoyer vrai si la première entrée est plus grande que la seconde.

source: Return true if the first input is smaller than or equal to the second input.
fr: Renvoyer vrai si la première entrée est plus petite ou égale à la seconde.

source: Return true if the first input is smaller than the second input.
fr: Renvoyer vrai si la première entrée est plus petite que la seconde.

source: Returns a list, of length 0, containing no data records
fr: Renvoyer une liste, de longueur 0, ne contenant aucun enregistrement

source: Returns a random item in a list.
fr: Renvoie un élément au hasard dans une liste.

source: Returns a specified portion of the text.
fr: Renvoie une partie indiquée du texte.

source: Returns either true or false.
fr: Renvoie soit vrai soit faux.

source: Returns null.
fr: Renvoie nul.

source: Returns the first item in a list.
fr: Renvoie le premier élément dans une liste.

source: Returns the index of the first/last occurrence of first text in the second text. Returns 0 if text is not found.
fr: Renvoie l’index de la première/dernière occurrence de la première chaîne dans la seconde. Renvoie 0 si la chaîne n’est pas trouvée.

source: Returns the index of the first/last occurrence of the item in the list. Returns 0 if text is not found.
fr: Renvoie l’index de la première/dernière occurrence de l’élément dans la liste. Renvoie 0 si le texte n’est pas trouvé.

source: Returns the item at the specified position in a list. #1 is the first item.
fr: Renvoie l’élément à la position indiquée dans une liste. #1 est le premier élément.

source: Returns the item at the specified position in a list. #1 is the last item.
fr: Renvoie l’élément à la position indiquée dans une liste. #1 est le dernier élément.

source: Returns the last item in a list.
fr: Renvoie le dernier élément dans une liste.

source: Returns the length of a list.
fr: Renvoie la longueur d’une liste.

source: Returns the letter at the specified position.
fr: Renvoie la lettre à la position indiquée.

source: Returns the number of letters (including spaces) in the provided text.
fr: Renvoie le nombre de lettres (espaces compris) dans le texte fourni.

source: Returns the value of this variable.
fr: Renvoie la valeur de cette variable.

source: Returns true if the input is false. Returns false if the input is true.
fr: Renvoie vrai si l’entrée est fausse. Renvoie faux si l’entrée est vraie.

source: Returns true if the list is empty.
fr: Renvoie vrai si la liste est vide.

source: Returns true if the provided text is empty.
fr: Renvoie vrai si le texte fourni est vide.

source: Reverting this exercise will erase all your work and cannot be undone. Are you sure that you want to proceed?
fr: Réinitialiser cet exercice effacera tout votre travail et le rendra irrécupérable. Êtes-vous sûr de vouloir continuer?

source: right
fr: droite

source: round
fr: arrondir

source: Round a number up or down.
fr: Arrondir un nombre au-dessus ou au-dessous.

source: round down
fr: arrondir à l’inférieur

source: round up
fr: arrondir au supérieur

source: Run the user-defined function '%1' and use its output.
fr: Exécuter la fonction '%1' définie par l’utilisateur et utiliser son résultat.

source: Run the user-defined function '%1'.
fr: Exécuter la fonction '%1' définie par l’utilisateur.

source: Session closed
fr: Session fermée

source: set
fr: mettre

source: Set heading.
fr: Changer la direction.

source: Set position.
fr: Changer la position.

source: Set the color of the body.
fr: Obtenir la couleur de la buggle.

source: Set x coordinate.
fr: Changer l'abscisse.

source: Set y coordinate.
fr: Changer l'ordonnée.

source: setBodyColor
fr: setCouleurCorps

source: setBrushColor
fr: setCouleurBrosse

source: Sets a random item in a list.
fr: Fixe un élément au hasard dans une liste.

source: Sets the first item in a list.
fr: Fixe le premier élément dans une liste.

source: Sets the item at the specified position in a list. #1 is the first item.
fr: Fixe l’élément à la position indiquée dans une liste. #1 est le premier élément.

source: Sets the item at the specified position in a list. #1 is the last item.
fr: Fixe l’élément à la position indiquée dans une liste. #1 est le dernier élément.

source: Sets the last item in a list.
fr: Fixe le dernier élément dans une liste.

source: Sets this variable to be equal to the input.
fr: Fixe cette variable pour qu’elle soit égale à la valeur de l’entrée.

source: Sign in
fr: Se connecter

source: Sign In
fr: Se connecter

source: Sign Out
fr: Se déconnecter

source: Skip the rest of this loop, and continue with the next iteration.
fr: Sauter le reste de cette boucle, et poursuivre avec l’itération suivante.

source: south
fr: sud

source: square root
fr: racine carrée

source: standard deviation of list
fr: écart-type de la liste

source: Start
fr: Démarrer

source: Submit
fr: Soumettre

source: Success \o/
fr: Exercice réussi \o/

source: sum of list
fr: somme de la liste

source: Switch exercise
fr: Changer d'exercice

source: Switch lesson
fr: Changer de leçon

source: Test cases:
fr: Cas de tests:

source: Text
fr: Texte

source: Thank you for your remark, we will do our best to integrate it. Follow our progress at {{url}}
fr: Merci pour votre remarque, nous ferons de notre mieux pour l'implémenter. Suivez nos progrès à {{url}}

source: Thanks for your feedback!
fr: Merci de votre retour!

source: The PLM currently saves your usage data anonymously on its servers. That way, you can retrieve your session from any connected computer as long as you sign in.
fr: La PLM enregistre actuellement vos données d'utilisation anonyme sur ses serveurs. Vous pouvez ainsi retrouver votre session depuis n'importe quel ordinateur.

source: The PLM will teach you the art of computer programming through interactive exercises, at your own pace.
fr: La PLM vous apprendra l'art de la programmation par le biais d'exercices interactifs réalisables à votre propre rythme.

source: This anonymous data can also help scientists to understand how people learn programming. With that in mind, we would like to provide your usage data and make it public.
fr: Ces données anonymes peuvent aussi aider les chercheurs à comprendre comment les utilisateurs apprennent la programmation. Dans cette optique, nous souhaitons mettre à disposition vos traces d'utilisations aux chercheurs en les rendant publiques.

source: This exercise's world view is not yet implemented. If you still want to pass this exercise, you only have at your disposition the instructions, the API and the results of your program's execution to understand the problem and solve it. You can also download and use the previous version of the PLM <a href="http://webloria.loria.fr/~quinson/Teaching/PLM/">here</a> to do this exercise.<a class="close">&times;</a>
fr: La représentation du monde de cet exercice n'est pas encore implémentée. Si tu veux tout de même faire cet exercice, tu n'as à ta disposition que les consignes, l'API du monde et le résultat retourné après l'exécution de ton programme pour comprendre le problème et le résoudre. Tu peux aussi télécharger et utiliser la version précédente de PLM <a href="http://webloria.loria.fr/~quinson/Teaching/PLM/">ici</a> pour faire cet exercice.<a class="close">&times;</a>

source: times
fr: fois

source: Title:
fr: Titre:

source: to
fr: à

source: to #
fr: jusqu’à #

source: to # from end
fr: jusqu’à # depuis la fin

source: to last
fr: jusqu’à la fin

source: to last letter
fr: jusqu’à la dernière lettre

source: to letter #
fr: jusqu’à la lettre #

source: to letter # from end
fr: jusqu’à la lettre # depuis la fin

source: to lower case
fr: en minuscules

source: to Title Case
fr: en Majuscule Au Début De Chaque Mot

source: to UPPER CASE
fr: en MAJUSCULES

source: trim spaces from both sides of
fr: supprimer les espaces des deux côtés

source: trim spaces from left side of
fr: supprimer les espaces du côté gauche

source: trim spaces from right side of
fr: supprimer les espaces du côté droit

source: true
fr: vrai

source: Turn back.
fr: Se retourner.

source: Turn left.
fr: Trouner à gauche.

source: Turn right.
fr: Tourner à droite.

source: Usage data release:
fr: Publication des traces d'utilisation:

source: Use your existing account on one of the following services to sign in:
fr: Utilisez votre compte d'un des services suivant pour vous authentifier:

source: Warning: This block may be used only within a function definition.
fr: Attention : Ce bloc pourrait n’être utilisé que dans une définition de fonction.

source: Warning: This block may only be used within a loop.
fr: Attention : Ce bloc ne devrait être utilisé que dans une boucle.

source: Warning: This function has duplicate parameters.
fr: Attention : Cette fonction a des paramètres dupliqués.

source: Warning!
fr: Attention!

source: Welcome {{ profile.user.firstName }} {{ profile.user.lastName }}
fr: Bienvenue {{ profile.user.firstName }} {{ profile.user.lastName }}

source: Welcome to the PLM, <small>the programmer's learning machine</small>
fr: Bienvenue dans la PLM, <small>l'exerciseur du programmeur</small>

source: west
fr: ouest

source: When you find a typo or a sentence that is hard to understand, it really helps to suggest a new wording.
fr: Quand vous trouvez une typo ou une phrase difficile à comprendre, vous nous aideriez beaucoup en suggérant une correction.

source: While a value is false, then do some statements.
fr: Tant qu’une valeur est fausse, alors exécuter certains ordres.

source: While a value is true, then do some statements.
fr: Tant qu’une valeur est vraie, alors exécuter certains ordres.

source: white
fr: blanc

source: with:
fr: avec :

source: World
fr: Monde

source: writeMessage
fr: ecritMessage

source: yellow
fr: jaune

source: Yes, sure
fr: Bien sûr

source: You can later update your preference from your profile's page.
fr: Vous pouvez changer vos préférences à tout instant depuis votre page de profil.

source: You have been brutally disconnected from the server, probably due to a crash. You should copy your current work before refreshing the page. Please excuse us for the inconvenience.
fr: Vous avez été brutalement déconnecté du serveur, probablement à cause d'un crash. Vous devriez copier votre travail actuel avant de rafraîchir la page. Veuillez nous excuser de ce désagrément.

source: You have been disconnected from the server. If it was not wanted, don't forget to copy your current work before refreshing the page.
fr: Vous avez été déconnecté du serveur. Si ce n'était pas prévu, n'oubliez pas de copier votre travail actuel avant de rafraîchir la page.

source: You have been logged out
fr: Vous avez été déconnecté

source: You have cleared this lesson! Do you want to go back to the home page?
fr: Vous avez terminé cette leçon! Voulez-vous revenir à la page d'accueil?

source: You have successfully signed in
fr: L'authentification s'est bien déroulée

source: Your feedback needs some little changes before being send, please fix the following issue(s):
fr: Votre retour nécessite quelques petites modifications avant d'être envoyé, veuillez corriger le ou les problèmes suivants:

source: Your profile has been successfully updated
fr: Votre profil a été correctement mis à jour
