Repository: BuggleInc/webPLM
Catalog: po/*.po
Languages: fr

source: , no nominative information is published, only the source code written to solve the challenges.
fr: , aucun nom n'est publié, seulement le code source écrit pour résoudre les exercices.

source: # from end
fr: # depuis la fin

source: %1 is empty
fr: %1 est vide

source: | step =
fr: | pas =

source: A letter, word, or line of text.
fr: Une lettre, un mot ou une ligne de texte.

source: A number.
fr: Un nombre.

source: About
fr: À propos

source: absolute
fr: absolu

source: Add a condition to the if block.
fr: Ajouter une condition au bloc si.

source: Add a final, catch-all condition to the if block.
fr: Ajouter une condition finale fourre-tout au bloc si.

source: Add a message.
fr: Ajouter un message.

source: Add a number to variable '%1'.
fr: Ajouter un nombre à la variable '%1'.

source: Add an input to the function.
fr: Ajouter une entrée à la fonction.

source: Add an item to the list.
fr: Ajouter un élément à la liste.

source: Add an item to the text.
fr: Ajouter un élément au texte.

source: Add Comment
fr: Ajouter un commentaire

source: Add, remove, or reorder inputs to this function.
fr: Ajouter, supprimer, ou réarranger les entrées de cette fonction.

source: Add, remove, or reorder sections to reconfigure this if block.
fr: Ajouter, supprimer ou réordonner les sections pour reconfigurer ce bloc si.

source: Add, remove, or reorder sections to reconfigure this list block.
fr: Ajouter, supprimer, ou réordonner les sections pour reconfigurer ce bloc de liste.

source: Add, remove, or reorder sections to reconfigure this text block.
fr: Ajouter, supprimer, ou réordonner des sections pour reconfigurer ce bloc de texte.

source: allow statements
fr: autoriser les déclarations

source: An error occurred while updating your profile. Please excuse us for the inconvenience and retry to submit your changes later.
fr: Une erreur est survenue lors de la mise à jour de votre profil. Veuillez nous excusez de ce désagrément et veuillez re-soumettre vos modifications plus tard.

source: and
fr: et

source: Animation speed:
fr: Vitesse d'animation:

source: Append some text to variable '%1'.
fr: Ajouter du texte à la variable '%1'.

source: append text
fr: ajouter le texte

source: Append the item to the end of a list.
fr: Ajouter l’élément à la fin d’une liste.

source: as
fr: comme

source: As you can see here
fr: Comme vous pouvez le voir ici

source: average of list
fr: moyenne de la liste

source: back
fr: retourne

source: backward
fr: reculer

source: black
fr: noir

source: blend
fr: mélanger

source: Blends two colours together with a given ratio (0.0 - 1.0).
fr: Mélange deux couleurs ensemble avec un ratio donné (0.0 - 1.0).

source: blue
fr: bleu

source: break out of loop
fr: sortir de la boucle

source: Break out of the containing loop.
fr: Sortir de la boucle englobante.

source: Brush
fr: Brosse

source: Brush down.
fr: Baisser la brosse.

source: Brush up.
fr: Lever la brosse.

source: brushDown
fr: baisseBrosse

source: brushUp
fr: leveBrosse

source: But DO NEVER DISCLOSE A PASSWORD to a bug tracker. Never.
fr: Mais NE COMMUNIQUEZ JAMAIS UN MOT DE PASSE à un outil de suivi de bugs. Jamais.

source: by
fr: de

source: Cancel
fr: Annuler

source: change
fr: incrémenter

source: Change the brush color.
fr: Modifier la couleur de la brosse.

source: Change value:
fr: Modifier la valeur :

source: Chat with your collaborator by typing in this box!
fr: Discuter avec votre collaborateur en tapant dans cette zone !

source: Check if a number is an even, odd, prime, whole, positive, negative, or if it is divisible by certain number. Returns true or false.
fr: Vérifier si un nombre est pair, impair, premier, entier, positif, négatif, ou s’il est divisible par un certain nombre. Renvoie vrai ou faux.

source: Check the condition in 'test'. If the condition is true, returns the 'if true' value, otherwise returns the 'if false' value.
fr: Vérifier la condition dans 'test'. Si elle est vraie, renvoie la valeur 'si vrai' ; sinon renvoie la valeur 'si faux'.

source: Check whether the buggle is currently selected in the interface.
fr: Renvoi si la buggle est actuellement sélectionnée dans l'interface.

source: Choose a colour at random.
fr: Choisir une couleur au hasard.

source: Choose a colour from the palette.
fr: Choisir une couleur dans la palette

source: clearMessage
fr: effaceMessage

source: Code editor:
fr: Éditeur de code:

source: Collapse Block
fr: Réduire le bloc

source: Collapse Blocks
fr: Réduire les blocs

source: Color.
fr: Couleur.

source: colour 1
fr: couleur 1

source: colour 2
fr: couleur 2

source: colour with
fr: colorer avec

source: Confirm changes
fr: Confirmer les modifications

source: Connexion lost
fr: Déconnecté

source: Constants
fr: Constantes

source: constrain %1 low %2 high %3
fr: contraindre %1 entre %2 et %3

source: Constrain a number to be between the specified limits (inclusive).
fr: Contraindre un nombre à être entre les limites spécifiées (incluses).

source: Contact
fr: Nous contacter

source: Contact us
fr: Nous contacter

source: Continue
fr: Continuer

source: continue with next iteration of loop
fr: continuer avec la prochaine itération de la boucle

source: count with
fr: compter avec

source: Create '%1'
fr: Créer '%1'

source: Create 'get %1'
fr: Créer 'obtenir %1'

source: Create 'set %1'
fr: Créer 'fixer %1'

source: Create a colour with the specified amount of red, green, and blue. All values must be between 0 and 100.
fr: Créer une couleur avec la quantité spécifiée de rouge, vert et bleu. Toutes les valeurs doivent être entre 0 et 100.

source: Create a list with any number of items.
fr: Créer une liste avec un nombre quelconque d’éléments.

source: Create a piece of text by joining together any number of items.
fr: Créer un morceau de texte en agrégeant un nombre quelconque d’éléments.

source: create empty list
fr: créer une liste vide

source: create list with
fr: créer une liste avec

source: create list with item %1 repeated %2 times
fr: créer une liste avec l’élément %1 répété %2 fois

source: create text with
fr: créer le texte avec

source: Creates a copy of the specified portion of a list.
fr: Crée une copie de la partie spécifiée d’une liste.

source: Creates a function with an output.
fr: Crée une fonction avec une sortie.

source: Creates a function with no output.
fr: Crée une fonction sans sortie.

source: Creates a list consisting of the given value repeated the specified number of times.
fr: Crée une liste consistant en la valeur fournie répétée le nombre de fois indiqué.

source: crossing
fr: traverse

source: Delete %1 Blocks
fr: Supprimer %1 blocs

source: Delete Block
fr: Supprimer le bloc

source: Description of the issue
fr: Description du problème

source: Did this suggestion helped you?
fr: Est-ce que cette suggestion vous a aidé?

source: Did we detect precisely your error?
fr: Est-ce que nous avons correctement détecté votre problème?

source: Disable Block
fr: Désactiver le bloc

source: do
fr: faire

source: Do some statements several times.
fr: Exécuter certains ordres plusieurs fois.

source: do something
fr: faire quelque chose

source: Do you accept to make public your usage data?
fr: Est-ce que vous acceptez de rendre public vos traces d'utilisations?

source: Do you want to share your data?
fr: Est-ce que vous souhaitez partager vos données?

source: Do you want to try the next one?
fr: Voulez-vous tenter l'exercice suivant?

source: drakgrey
fr: gris foncé

source: Drop a baggle.
fr: Poser un biscuit.

source: dropBaggle
fr: poseBiscuit

source: Duplicate
fr: Dupliquer

source: east
fr: est

source: Edit profile
fr: Modifier le profil

source: else
fr: sinon

source: else if
fr: sinon si

source: Enable Block
fr: Activer le bloc

source: Erase the message.
fr: Effacer le message.

source: Error during update
fr: Erreur au cours de la mise à jour

source: Execution results
fr: Résultats de l'exécution

source: exitReached
fr: sortieAtteinte

source: Expand Block
fr: Développer le bloc

source: Expand Blocks
fr: Développer les blocs

source: External Inputs
fr: Entrées externes

source: false
fr: faux

source: find first occurrence of item
fr: trouver la première occurrence de l’élément

source: find first occurrence of text
fr: trouver la première occurrence de la chaîne

source: find last occurrence of item
fr: trouver la dernière occurrence de l’élément

source: find last occurrence of text
fr: trouver la dernière occurrence de la chaîne

source: first
fr: premier

source: First name:
fr: Prénom:

source: for each item
fr: pour chaque élément

source: For each item in a list, set the variable '%1' to the item, and then do some statements.
fr: Pour chaque élément dans une liste, donner la valeur de l’élément à la variable '%1', puis exécuter certains ordres.

source: forward
fr: avancer

source: from %1 to %2 by %3
fr: de %1 à %2 par %3

source: get
fr: obtenir

source: get and remove
fr: obtenir et supprimer

source: Get brush position.
fr: Obtenir la position de la brosse.

source: get first letter
fr: obtenir la première lettre

source: Get heading.
fr: Obtenir la direction.

source: get last letter
fr: obtenir la dernière lettre

source: get letter #
fr: obtenir la lettre #

source: get letter # from end
fr: obtenir la lettre # depuis la fin

source: get random letter
fr: obtenir une lettre au hasard

source: get sub-list from #
fr: obtenir la sous-liste depuis #

source: get sub-list from # from end
fr: obtenir la sous-liste depuis # depuis la fin

source: get sub-list from first
fr: obtenir la sous-liste depuis le début

source: get substring from first letter
fr: obtenir la sous-chaîne depuis la première lettre

source: get substring from letter #
fr: obtenir la sous-chaîne depuis la lettre #

source: get substring from letter # from end
fr: obtenir la sous-chaîne depuis la lettre # depuis la fin

source: Get the color of the body.
fr: Obtenir la couleur de la buggle.

source: Get the color of the brush.
fr: Obtenir la couleur de la brosse.

source: Get the color of the ground.
fr: Obtenir la couleur du sol.

source: Get x coordinate.
fr: Obtenir l'abscisse.

source: Get y coordinate.
fr: Obtenir l'ordonnée

source: getBodyColor
fr: getCouleurCorps

source: getBrushColor
fr: getCouleurBrosse

source: getGroundColor
fr: getCouleurSol

source: getWorldHeight
fr: getHauteurMonde

source: getWorldWidth
fr: getLargeurMonde

source: gray
fr: gris

source: green
fr: vert

source: Have the variable %1 take on the values from the start number to the end number, counting by the specified interval, and do the specified blocks.
fr: Faire en sorte que la variable %1 prenne les valeurs depuis le numéro de début jusqu’au numéro de fin, en s’incrémentant de l’intervalle spécifié, et exécuter les ordres spécifiés.

source: Help
fr: Aide

source: Highlight function definition
fr: Surligner la définition de la fonction

source: Home
fr: Accueil

source: https://code.google.com/p/blockly/wiki/Loops#for_each for each block
fr: https://github.com/google/blockly/wiki/Loops#for-each pour chaque bloc

source: https://en.wikipedia.org/wiki/Color
fr: https://fr.wikipedia.org/wiki/Couleur

source: if
fr: si

source: If a value is true, then do some statements.
fr: Si une valeur est vraie, alors exécuter certains ordres.

source: If a value is true, then do the first block of statements. Otherwise, do the second block of statements.
fr: Si une valeur est vraie, alors exécuter le premier bloc d’ordres. Sinon, exécuter le second bloc d’ordres.

source: If a value is true, then return a second value.
fr: Si une valeur est vraie, alors renvoyer une seconde valeur.

source: if false
fr: si faux

source: If the first value is true, then do the first block of statements. Otherwise, if the second value is true, do the second block of statements.
fr: Si la première valeur est vraie, alors exécuter le premier bloc d’ordres. Sinon, si la seconde valeur est vraie, exécuter le second bloc d’ordres.

source: If the first value is true, then do the first block of statements. Otherwise, if the second value is true, do the second block of statements. If none of the values are true, do the last block of statements.
fr: Si la première valeur est vraie, alors exécuter le premier bloc d’ordres. Sinon, si la seconde valeur est vraie, exécuter le second bloc d’ordres. Si aucune des valeurs n’est vraie, exécuter le dernier bloc d’ordres.

source: if true
fr: si vrai

source: If you encounter a technical bug, please tell us what you did, which outcome you were expecting and what happened instead.
fr: Si vous avez rencontré un bug, veuillez nous expliquer comment vous l'avez produit, le résultat que vous attendiez et ce qui s'est passé à la place.

source: in list
fr: dans la liste

source: in text
fr: dans le texte

source: Inline Inputs
fr: Entrées en ligne

source: input name:
fr: nom de l’entrée :

source: inputs
fr: entrées

source: insert at
fr: insérer en

source: Inserts the item at the specified position in a list. #1 is the first item.
fr: Insère l’élément à la position indiquée dans une liste. #1 est le premier élément.

source: Inserts the item at the specified position in a list. #1 is the last item.
fr: Insère l’élément à la position indiquée dans une liste. #1 est le dernier élément.

source: Inserts the item at the start of a list.
fr: Insère l’élément au début d’une liste.

source: Inserts the item randomly in a list.
fr: Insère l’élément au hasard dans une liste.

source: Instructions
fr: Consignes

source: is divisible by
fr: est divisible par

source: is even
fr: est pair

source: is negative
fr: est négatif

source: is odd
fr: est impair

source: is positive
fr: est positif

source: is prime
fr: est premier

source: is whole
fr: est entier

source: isBackingWall
fr: estDosMur

source: isBrushDown
fr: estBrosseBaissee

source: isCarryingBaggle
fr: porteBiscuit

source: isFacingWall
fr: estFaceMur

source: isGroundWhite
fr: solEstBlanc

source: isOverBaggle
fr: estSurBiscuit

source: isOverMessage
fr: estSurMessage

source: isOverOrange
fr: solEstOrange

source: isSelected
fr: estChoisie

source: Issue created
fr: Ticket ouvert

source: item
fr: élément

source: join
fr: joindre

source: last
fr: dernier

source: Last name:
fr: Nom:

source: left
fr: gauche

source: length of %1
fr: longueur de %1

source: Let me decide later
fr: Décider plus tard

source: lightgrey
fr: gris clair

source: list
fr: liste

source: List of lessons
fr: Liste des leçons

source: Lists
fr: Listes

source: Logic
fr: Logique

source: Login failed; request failed
fr: Échec de la connexion; échec de la requête

source: Look for a baggle in bag.
fr: Vrai si on porte un biscuit.

source: Look for a baggle on the ground.
fr: Vrai si biscuit par terre.

source: Look for a message.
fr: Chercher un message.

source: Look for a wall backward.
fr: Chercher un mur derrière.

source: Look for a wall forward.
fr: Chercher un mur devant.

source: Loops
fr: Boucles

source: max of list
fr: maximum de la liste

source: Me
fr: Moi

source: median of list
fr: médiane de la liste

source: min of list
fr: minimum de la liste

source: modes of list
fr: majoritaires de la liste

source: Move
fr: Mouvement

source: Moving backward.
fr: Avancer.

source: Moving forward.
fr: Reculer.

source: New variable name:
fr: Nom de la nouvelle variable :

source: New variable...
fr: Nouvelle variable…

source: No error logs yet... Congratulations!
fr: Pas de messages d'erreurs pour le moment...Félicitations!

source: No results yet, please run your program before.
fr: Pas de résultats pour le moment, veuillez exécuter votre programme au préalable.

source: No, don't publish my data
fr: Non, ne publiez pas mes données

source: north
fr: nord

source: not %1
fr: pas %1

source: Not chosen yet
fr: Pas encore de décision prise

source: Not yet
fr: Pas encore

source: null
fr: nul

source: Ok, share my data
fr: Ok, partager mes données

source: or
fr: ou

source: or try again later?
fr: ou réessayer plus tard?

source: Other links
fr: Autres liens

source: Password
fr: Mot de passe

source: Password:
fr: Mot de passe:

source: Pick a lesson on the left, and start coding! If unsure, take the "welcome" one: it will guide you through the basics.
fr: Choisissez une leçon sur la gauche, et commencez à coder! Si vous débutez, sélectionnez celle intitulée "welcome": vous y apprendrez les bases de la programmation.

source: Pickup a baggle.
fr: Ramasse un biscuit.

source: pickupBaggle
fr: prendBiscuit

source: pink
fr: rose

source: Please authorize this app to enable your work to be saved and to allow it to be shared by you.
fr: Veuillez autoriser cette application à permettre la sauvegarde de votre travail et à l’autoriser de le partager avec vous.

source: Please name the problem
fr: Veuillez nommer le problème

source: Please write your suggestion below, with all necessary details (if possible in English or French).
fr: Veuillez présenter votre suggestion ci-dessous, avec tous les détails nécessaires (en français ou anglais si possible).

source: print %1
fr: afficher %1

source: Print the specified text, number or other value.
fr: Afficher le texte, le nombre ou une autre valeur spécifié.

source: Profile
fr: Profil

source: prompt for number with message
fr: invite pour un nombre avec un message

source: prompt for text with message
fr: invite pour un texte avec un message

source: Prompt for user for a number.
fr: Demander un nombre à l’utilisateur.

source: Prompt for user for some text.
fr: Demander un texte à l’utilisateur.

source: random
fr: aléatoire

source: random colour
fr: couleur aléatoire

source: random fraction
fr: fraction aléatoire

source: random integer from %1 to %2
fr: entier aléatoire entre %1 et %2

source: random item of list
fr: élément aléatoire de la liste

source: Read the message.
fr: Lire le message.

source: readMessage
fr: litMessage

source: red
fr: rouge

source: remainder of %1 ÷ %2
fr: reste de %1 ÷ %2

source: remove
fr: supprimer

source: Remove Comment
fr: Supprimer un commentaire

source: Removes a random item in a list.
fr: Supprime un élément au hasard dans une liste.

source: Removes and returns a random item in a list.
fr: Supprime et renvoie un élément au hasard dans une liste.

source: Removes and returns the first item in a list.
fr: Supprime et renvoie le premier élément dans une liste.

source: Removes and returns the item at the specified position in a list. #1 is the first item.
fr: Supprime et renvoie l’élément à la position indiquée dans une liste. #1 est le premier élément.

source: Removes and returns the item at the specified position in a list. #1 is the last item.
fr: Supprime et renvoie l’élément à la position indiquée dans une liste. #1 est le dernier élément.

source: Removes and returns the last item in a list.
fr: Supprime et renvoie le dernier élément dans une liste.

source: Removes the first item in a list.
fr: Supprime le premier élément dans une liste.

source: Removes the item at the specified position in a list. #1 is the first item.
fr: Supprime l’élément à la position indiquée dans une liste. #1 est le premier élément.

source: Removes the item at the specified position in a list. #1 is the last item.
fr: Supprime l’élément à la position indiquée dans une liste. #1 est le dernier élément.

source: Removes the last item in a list.
fr: Supprime le dernier élément dans une liste.

source: Rename all '%1' variables to:
fr: Renommer toutes les variables '%1' en :

source: Rename variable...
fr: Renommer la variable…

source: repeat
fr: répéter

source: repeat %1 times
fr: répéter %1 fois

source: repeat until
fr: répéter jusqu’à

source: repeat while
fr: répéter tant que

source: Report a bug
fr: Signaler un bug

source: Report an issue:
fr: Signaler un problème:

source: Reset
fr: Réinitialiser

source: Result
fr: Résultat

source: return
fr: retour

source: Return 10 to the power of a number.
fr: Renvoie 10 à la puissance d’un nombre.

source: Return a copy of the text in a different case.
fr: Renvoyer une copie du texte dans une autre casse.

source: Return a copy of the text with spaces removed from one or both ends.
fr: Renvoyer une copie du texte avec les espaces supprimés d’un bout ou des deux.

source: Return a list of the most common item(s) in the list.
fr: Renvoyer une liste des élément(s) le(s) plus courant(s) dans la liste.

source: Return a random element from the list.
fr: Renvoyer un élément dans la liste au hasard.

source: Return a random fraction between 0.0 (inclusive) and 1.0 (exclusive).
fr: Renvoyer une fraction aléatoire entre 0.0 (inclus) et 1.0 (exclus).

source: Return a random integer between the two specified limits, inclusive.
fr: Renvoyer un entier aléatoire entre les deux limites spécifiées, incluses.

source: Return e to the power of a number.
fr: Renvoie e à la puissance d’un nombre.

source: Return one of the common constants: gettextCatalog.getString(π (3.141…), e (2.718…), φ (1.618…), sqrt(2) (1.414…), sqrt(½) (0.707…), or ∞ (infinity).
fr: Renvoie une des constantes courantes : π (3.141…), e (2.718…), φ (1.618…), sqrt(2) (1.414…), sqrt(½) (0.707…), ou ∞ (infini).

source: Return the absolute value of a number.
fr: Renvoie la valeur absolue d’un nombre.

source: Return the arccosine of a number.
fr: Renvoie l’arccosinus d’un nombre.

source: Return the arcsine of a number.
fr: Renvoie l’arcsinus d’un nombre.

source: Return the arctangent of a number.
fr: Renvoie l’arctangente d’un nombre.

source: Return the average (arithmetic mean) of the numeric values in the list.
fr: Renvoyer la moyenne (arithmétique) des valeurs numériques dans la liste.

source: Return the base 10 logarithm of a number.
fr: Renvoie le logarithme base 10 d’un nombre.

source: Return the cosine of a degree (not radian).
fr: Renvoie le cosinus d’un angle en degrés (pas en radians).

source: Return the difference of the two numbers.
fr: Renvoie la différence des deux nombres.

source: Return the first number raised to the power of the second number.
fr: Renvoie le premier nombre élevé à la puissance du second.

source: Return the largest number in the list.
fr: Renvoyer le plus grand nombre dans la liste.

source: Return the median number in the list.
fr: Renvoyer le nombre médian dans la liste.

source: Return the natural logarithm of a number.
fr: Renvoie le logarithme naturel d’un nombre.

source: Return the negation of a number.
fr: Renvoie l’opposé d’un nombre

source: Return the product of the two numbers.
fr: Renvoie le produit des deux nombres.

source: Return the quotient of the two numbers.
fr: Renvoie le quotient des deux nombres.

source: Return the remainder from dividing the two numbers.
fr: Renvoyer le reste de la division des deux nombres.

source: Return the sine of a degree (not radian).
fr: Renvoie le sinus d’un angle en degrés (pas en radians).

source: Return the smallest number in the list.
fr: Renvoyer le plus petit nombre dans la liste.

source: Return the square root of a number.
fr: Renvoie la racine carrée d’un nombre.

source: Return the standard deviation of the list.
fr: Renvoyer l’écart-type de la liste.

source: Return the sum of all the numbers in the list.
fr: Renvoyer la somme de tous les nombres dans la liste.

source: Return the sum of the two numbers.
fr: Renvoie la somme des deux nombres.

source: Return the tangent of a degree (not radian).
fr: Renvoie la tangente d’un angle en degrés (pas en radians).

source: Return true if at least one of the inputs is true.
fr: Renvoyer vrai si au moins une des entrées est vraie.

source: Return true if both inputs are not equal to each other.
fr: Renvoyer vrai si les deux entrées ne sont pas égales.

source: Return true if both inputs are true.
fr: Renvoyer vrai si les deux entrées sont vraies.

source: Return true if both inputs equal each other.
fr: Renvoyer vrai si les deux entrées sont égales.
